master/cases/sydney/ic.coarse/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "2200";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   nonuniform List<scalar> 
5460
(
858.653
860.29
861.638
862.768
863.733
864.577
865.331
866.023
...
)
;

boundaryField
{
    nozzle
    {
        type            timeVaryingMappedFixedValue;
        setAverage      0;
        value           nonuniform List<scalar> 
12
(
856.645
922.089
1056.95
1275.78
1597.43
2058.86
2708.22
3659.08
5113.81
7715.91
13531.4
44323.4
)
;
    }
    coflow
    {
        type            fixedValue;
        value           uniform 1;
    }
    walls
    {
        type            compressible::epsilonWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           nonuniform List<scalar> 
130
(
0.00932885
0.00930396
0.00927842
0.00925228
0.00922557
0.00919832
0.00917054
0.00914224
...
)
;
    }
    back
    {
        type            wedge;
    }
    front
    {
        type            wedge;
    }
    outlet
    {
        type            zeroGradient;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
