master/cases/sydney/ic.coarse/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "2200";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
5460
(
2.80723
2.8094
2.81109
2.81245
2.81357
2.81453
2.81538
2.81617
...
)
;

boundaryField
{
    nozzle
    {
        type            timeVaryingMappedFixedValue;
        setAverage      0;
        value           nonuniform List<scalar> 
12
(
2.80438
2.88899
3.05414
3.29933
3.6178
4.00353
4.44367
4.93012
5.45245
6.00599
6.58625
7.24176
)
;
    }
    coflow
    {
        type            fixedValue;
        value           uniform 0.0018;
    }
    walls
    {
        type            compressible::kqRWallFunction;
        value           nonuniform List<scalar> 
130
(
0.00179688
0.00179368
0.0017904
0.00178703
0.00178359
0.00178008
0.00177649
0.00177284
...
)
;
    }
    back
    {
        type            wedge;
    }
    front
    {
        type            wedge;
    }
    outlet
    {
        type            zeroGradient;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
